---
kind: property
id: P:Autodesk.Revit.DB.RenderingImageExposureSettings.Saturation
source: html/9db6cc79-38e2-12e8-ed23-d3f65846a326.htm
---
# Autodesk.Revit.DB.RenderingImageExposureSettings.Saturation Property

The value of rendering image saturation.

## Syntax (C#)
```csharp
public double Saturation { get; set; }
```

## Remarks
Increase this value to get more intense colors.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The value of saturation is not valid. The valid range is 0 to 5.